# По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b,
# проходящей через эти точки.

x1 = float(input('введите координату х первой точки :'))
y1 = float(input('введите координату y первой точки :'))
x2 = float(input('введите координату х второй точки :'))
y2 = float(input('введите координату y второй точки :'))

if x1 == x2 :
    print('x = ', x1 )
elif y1 == y2 :
    print('y = ', y1)
else:
    k = (y1 - y2) / (x1 - x2)
    b = y2 - k * x2
    if b > 0:
        print(f'y = {k}*x + {b}')
    elif b == 0:
        print(f'y = {k}*x')
    else:
        print(f'y = {k}*x {b}')



